# 第六章 数据加载、存储与文件格式

6.1 读写文本格式的数据

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('examples/ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_table('examples/ex1.csv',)   #不指定分隔符

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [7]:
pd.read_csv('examples/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [9]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [10]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd','message']) #自己定义列名称

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names=['a', 'b', 'c', 'd','message']

In [13]:
pd.read_csv('examples/ex2.csv', names=names, index_col='a')

    b   c   d message
a
1   2   3   4   hello
5   6   7   8   world
9  10  11  12     foo

In [14]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col=['key1', 'key2'])

In [15]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [19]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [20]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
%cat examples/ex4.csv

UsageError: Line magic function `%cat` not found.

In [26]:
result = pd.read_csv('examples/ex5.csv')

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [30]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [31]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [33]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [34]:
pd.options.display.max_rows = 10

In [36]:
result = pd.read_csv('examples/ex6.csv')

In [37]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [38]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [40]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [41]:
chunker

In [42]:
tot = pd.Series([])

In [43]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [44]:
tot = tot.sort_values(ascending=False)

In [45]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

将数据写出到文本格式

In [46]:
data = pd.read_csv('examples/ex5.csv')

In [47]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [48]:
data.to_csv('examples/out.csv')

In [49]:
data_ = pd.read_csv('examples/out.csv')

In [50]:
data_

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [51]:
import sys

In [52]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [53]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [54]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

处理分隔符格式

In [55]:
import csv

In [56]:
f = open('examples/ex7.csv')

In [57]:
reader = csv.reader(f)

In [58]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [60]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [61]:
header, values = lines[0], lines[1:]

JSON数据

In [62]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [63]:
import json

In [64]:
result = json.loads(obj)

In [65]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [66]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [67]:
asjson = json.dumps(result)

In [68]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [69]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [70]:
data = pd.read_json('examples/example.json')

In [71]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [72]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

6.2 二进制数据格式

In [73]:
frame = pd.read_csv('examples/ex1.csv')

In [74]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [75]:
frame.to_pickle('examples/frame_pickle')

In [76]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

6.3 Web APIs交互

In [82]:
import requests

In [83]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [84]:
resp = requests.get(url)

In [85]:
resp

In [86]:
data = resp.json()

In [87]:
data[0]['title']

'BUG: caught typeError in series.at (#25506)'

In [88]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [89]:
issues

,number,title,labels,state
0,25533,BUG: caught typeError in series.at (#25506),[],open
1,25532,DOC: fix docstring for pandas.read_parquet,[],open
2,25531,Bug groupby idxmin,[],open
3,25529,fix segfault when running with cython coverage...,[],open
4,25528,DOC: Polishing typos out of doc/source/user_gu...,[],open
...,...,...,...,...
25,25499,BUG: Overflow in IntervalIndex/IntervalArray m...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
26,25497,regression in error message for DatetimeIndex ...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
27,25495,Unexpected dtype when using .loc to set Catego...,[],open
28,25488,Fix JSON orient='table' issues with numeric co...,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
29,25484,BUG: User-facing AssertionError with add colum...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open

6.4 数据库交互

In [90]:
import sqlite3

In [91]:
query = """
.....: CREATE TABLE test
.....: (a VARCHAR(20), b VARCHAR(20),
.....: c REAL, d INTEGER
.....: );"""

In [92]:
con = sqlite3.connect('mydata.sqlite')

In [93]:
con.execute(query)

In [94]:
con.commit()

In [95]:
data = [('Atlanta', 'Georgia', 1.25, 6),
.....: ('Tallahassee', 'Florida', 2.6, 3),
.....: ('Sacramento', 'California', 1.7, 5)]

In [96]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [97]:
cursor = con.execute('select * from test')

In [98]:
rows = cursor.fetchall()

In [99]:
rows

[]

In [100]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [101]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

Empty DataFrame
Columns: [a, b, c, d]
Index: []

ModuleNotFoundError: No module named 'sqlalchemy'